<?php

// ---------------------------------------------------------------------
// ---                      تنظیمات اصلی ربات                         ---
// ---------------------------------------------------------------------

define('BOT_TOKEN', 'TOKEN');

define('ADMIN_CHAT_ID', 123456789);

// ---------------------------------------------------------------------
// ---                         مسیرهای پروژه                           ---
// ---------------------------------------------------------------------

// data or log
define('DATA_DIR', __DIR__ . '/../data');

// ---------------------------------------------------------------------
// ---                   تنظیمات اتصال به پایگاه داده                  ---
// ---------------------------------------------------------------------

define('DB_HOST', 'localhost');     
define('DB_NAME', 'NAME');   
define('DB_USER', 'USER');  
define('DB_PASS', 'PASSWORD');

// ---------------------------------------------------------------------
// ---         ایجاد خودکار پوشه دیتا در صورت عدم وجود              ---
// ---------------------------------------------------------------------

if (!is_dir(DATA_DIR)) {
    if (!mkdir(DATA_DIR, 0775, true)) {
        die('Failed to create data directory. Please check server permissions.');
    }
}
?>
